misurazioni/artillery-test-graphql.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/graphql"
          json:
            query: |
              {
                products {
                  id
                  name
                  price
                  stock
                }
              }